In [1]:
import pandas as pd

In [2]:
csv_file = 'amazon_prices_OUTPUT.csv'

In [16]:
df = pd.read_csv(csv_file)
print(df.head())
print(df.shape)

           script_time             item   price
0  2019-11-06 11:23:16  bose_headphones  349.00
1  2019-11-06 11:23:19   ring_doorbell2  199.00
2  2019-11-06 11:23:22    ring_doorbell    1.99
3  2019-11-06 21:33:51  bose_headphones  349.00
4  2019-11-06 21:34:01   ring_doorbell2  199.00
(45, 3)

In [46]:
# group by item lowest price
print(df.groupby(['item']).min())

                              script_time   price
item
5-shelf_storage_unit  2019-11-14 16:05:48   59.99
bose_headphones       2019-11-06 11:23:16  279.00
ring_doorbell         2019-11-06 11:23:22    1.99
ring_doorbell2        2019-11-06 11:23:19  129.00

In [43]:
# group by select specific column
df.groupby(['item'])[['price', 'script_time']].max()

                       price          script_time
item
5-shelf_storage_unit   59.99  2019-11-25 12:06:42
bose_headphones       349.00  2019-11-25 12:09:54
ring_doorbell          99.99  2019-11-25 12:06:33
ring_doorbell2        199.00  2019-11-25 12:10:03

In [44]:
df.groupby(['item'], sort=True)['price'].min()

item
5-shelf_storage_unit     59.99
bose_headphones         279.00
ring_doorbell             1.99
ring_doorbell2          129.00
Name: price, dtype: float64

In [10]:
# group by item max price
print(df.groupby(['item']).max())

                              script_time   price
item
5-shelf_storage_unit  2019-11-25 12:06:42   59.99
bose_headphones       2019-11-25 12:09:54  349.00
ring_doorbell         2019-11-25 12:06:33   99.99
ring_doorbell2        2019-11-25 12:10:03  199.00

In [27]:
# another way to get lowest prices
df.sort_values('price',ascending=True).drop_duplicates(['item'])

            script_time                  item   price
2   2019-11-06 11:23:22         ring_doorbell    1.99
22  2019-11-16 04:43:45  5-shelf_storage_unit   59.99
40  2019-11-25 12:06:25        ring_doorbell2  129.00
7   2019-11-08 10:29:29       bose_headphones  279.00

In [30]:
df.groupby(['item']).agg(['min','max','count','nunique'])

                              script_time                                     \
                                      min                  max count nunique
item
5-shelf_storage_unit  2019-11-14 16:05:48  2019-11-25 12:06:42     8       8
bose_headphones       2019-11-06 11:23:16  2019-11-25 12:09:54    13      13
ring_doorbell         2019-11-06 11:23:22  2019-11-25 12:06:33    12      12
ring_doorbell2        2019-11-06 11:23:19  2019-11-25 12:10:03    12      12

                       price
                         min     max count nunique
item
5-shelf_storage_unit   59.99   59.99     8       1
bose_headphones       279.00  349.00    13       3
ring_doorbell           1.99   99.99    12       2
ring_doorbell2        129.00  199.00    12       3

In [52]:
csv_file2= 'flight_ticket_prices_OUTPUT.csv'
flights = pd.read_csv(csv_file2)

In [56]:
flights.head()

           script_time airline destination travel_date   price
0  2019-11-08 10:45:59     All          LA     Dec2019  $1,808
1  2019-11-08 10:46:06  UNITED     Houston   April2020  $1,195
2  2019-11-08 10:46:13     All     Houston   April2020    $856
3  2019-11-08 10:46:20     All     Seattle   April2020  $1,180
4  2019-11-08 10:46:28     All     Phoenix   April2020  $1,252

In [63]:

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
print(df)
grouped = df.groupby('Year')

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [64]:
for name,group in grouped:
   print(name)
   print (group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690